In [1]:
import pandas as pd
import mysql.connector

In [2]:
df_data = pd.read_csv(r"C:\Users\Shiman\OneDrive\Desktop\sample.csv")
df_data.head()

   employee_no    employee_name                         department  active
0            1     Ethan Miller  Finance and Accounting Department    True
1            2     Olivia Davis  Research and Development Division    True
2            3  Mason Rodriguez  Research and Development Division    True
3            4     Ava Thompson  Research and Development Division    True
4            5   Liam Hernandez         Human Resources Department    True

In [3]:
for index , rows in df_data.head().iterrows():
    print((rows['employee_no'],rows['employee_name']))

(1, 'Ethan Miller')
(2, 'Olivia Davis')
(3, 'Mason Rodriguez')
(4, 'Ava Thompson')
(5, 'Liam Hernandez')

In [4]:
connection = mysql.connector.Connect(database ='codewithmandeep',host = 'localhost', user = 'root', password = '@Mandeep1712')

#Creating a cursor
cursor = connection.cursor()

schema_name = 'codewithmandeep'
table_name =  'output_table'

#Create table in mysql database
creating_table = f''' 
CREATE TABLE {schema_name}.{table_name} (column1 INT , column2 VARCHAR(100));
'''

cursor.execute(creating_table)

In [5]:
#Inserting data into mysqltable

insert_data_query = f''' 
INSERT INTO {schema_name}.{table_name} (column1 , column2) VALUES (%s, %s)
'''

for index , rows in df_data.iterrows():
    
    values = (rows['employee_no'],rows['employee_name'])
    # print(values)
    cursor.execute(insert_data_query,values)

print('Code run sucessfully')

Code run sucessfully

In [6]:
# Commit the changes
connection.commit()

cursor.close()
connection.close()